Mafqood/app/controllers/finding_posts_controller.rb

    def index
    @finding_posts = FindingPost.order("created_at desc")
---
SELECT `finding_posts`.* FROM `finding_posts`  ORDER BY created_at desc

  def show
    @finding_post = FindingPost.find(params[:id])
---
SELECT  `finding_posts`.* FROM `finding_posts` WHERE `finding_posts`.`id` = 2 LIMIT 1

  def create
    @finding_post = FindingPost.new(finding_post_params)
    @finding_post.user = current_user
    if @finding_post.save
---
INSERT INTO `finding_posts` (`name`, `contact_info`, `description`, `age`, `special_signs`, `image`, `location`, `gender`, `user_id`, `created_at`, `updated_at`) VALUES ('asd', '01114052215', 'asdasd', 0, 'asdasd', '994887_464400687000438_1563613560_n.jpg', 'asd', 1, 1, '2015-03-20 21:10:00.779366', '2015-03-20 21:10:00.779366')