Mafqood/app/controllers/missing_posts_controller.rb

SELECT `missing_posts`.* FROM `missing_posts`  ORDER BY created_at desc
---
  def index
    @missing_posts = MissingPost.new
    @missing_posts = MissingPost.order("created_at desc")

SELECT  `missing_posts`.* FROM `missing_posts` WHERE `missing_posts`.`id` = 1 LIMIT 1
---
  def show
    @missing_post = MissingPost.find(params[:id])

INSERT INTO `missing_posts` (`age`, `location`, `reporter_name`, `reporter_phone`, `description`, `image`, `gender`, `special_signs`, `user_id`, `created_at`, `updated_at`) VALUES (2, 'asd', '123123', '01142052211', '123', '994887_464400687000438_1563613560_n.jpg', ' Male', '21312', 1, '2015-03-20 21:52:52.887933', '2015-03-20 21:52:52.887933')
---
  def create
    @missing_post = MissingPost.new(missing_params)
    @missing_post.user = current_user
    if @missing_post.save

SELECT  `missing_posts`.* FROM `missing_posts` WHERE `missing_posts`.`id` = 3 LIMIT 1
---
  def edit
    @missing = MissingPost.find(params[:id])

SELECT  `missing_posts`.* FROM `missing_posts` WHERE `missing_posts`.`id` = 4 LIMIT 1
UPDATE `missing_posts` SET `age` = 13, `image` = 'background43.jpg', `updated_at` = '2015-04-07 20:55:11.338231' WHERE `missing_posts`.`id` = 7
---
  def update
    @missing = MissingPost.find(params[:id])
    if @missing.update(missing_params)

SELECT  `missing_posts`.* FROM `missing_posts` WHERE `missing_posts`.`id` = 2 LIMIT 1
INSERT INTO `missing_post_reports` (`type`, `user_id`, `missing_post_id`, `created_at`, `updated_at`) VALUES ('mine', 1, 2, '2015-03-31 09:41:09.058930', '2015-03-31 09:41:09.058930')
---
  def report
    @missing = MissingPost.find(params[:id])
    @report_mine = MissingPostReport.new
    @report_mine.kind = "mine"
    @report_mine.user_id = current_user.id
    @report_mine.missing_post_id = @missing.id
    @report_mine.save