Mafqood/app/controllers/sessions_controller.rb

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`provider` = 'facebook' AND `accounts`.`uid` = '10152681609701976' LIMIT 1
---
  def new
    auth = env["omniauth.auth"]
    account = Account.find_by_provider_and_uid(auth.provider, auth.uid)