Mafqood/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`) VALUES ('Mohamed Ashraf', 'mohamed-mehany@hotmail.com', '2015-03-20 14:12:12.346921', '2015-03-20 14:12:12.346921')
INSERT INTO `accounts` (`user_id`, `provider`, `uid`, `created_at`, `updated_at`) VALUES (1, 'facebook', '10152681609701976', '2015-03-20 14:12:12.462484', '2015-03-20 14:12:12.462484')
---
  def create
    @user = User.new(user_params)
    if @user.save
      Account.create(user_id: @user.id, provider: params[:provider], uid: params[:uid])