app/controllers/finding_posts_controller.rb

SELECT `finding_posts`.* FROM `finding_posts`  ORDER BY created_at desc
---
  def index
     @findings = FindingPost.all

INSERT INTO `finding_posts` (`name`, `contact_info`, `description`, `age`, `special_signs`, `image`, `location`, `gender`, `user_id`, `created_at`, `updated_at`) VALUES ('ahmed', '01222312312', 'asdasdada', 12, 'dadsdad', '11038012_1087847254571749_8130021856225197609_n.jpg', 'dadasdada', 1, 1, '2015-03-25 20:03:28.200621', '2015-03-25 20:03:28.200621')
---
  def create
  #  if (current_user)
    	@finding = FindingPost.new(finding_params)
  #  	@finding.user = current_user
      if @finding.save