app/controllers/suspect_posts_controller.rb

  def index
    @suspects = SuspectPost.order("created_at desc")
---
SELECT `suspect_posts`.* FROM `suspect_posts`  ORDER BY created_at desc

  def create
    @suspect_post = SuspectPost.create(suspect_post_params)
---
INSERT INTO `suspect_posts` (`approximate_age`, `gender`, `location`, `image`, `description`, `special_signs`, `reporter_name`, `reporter_phone`, `created_at`, `updated_at`) VALUES ('13', 'Female', 'nasr city', 'Screenshot_from_2015-03-13_02_43_23.png', 'tayh', 'adjljd', 'ahmedd', '01234423256', '2015-03-25 21:32:18.931704', '2015-03-25 21:32:18.931704')

  def show
    @suspect_post = SuspectPost.find(params[:id])
---
SELECT  `suspect_posts`.* FROM `suspect_posts` WHERE `suspect_posts`.`id` = 1 LIMIT 1