app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`) VALUES ('Ahmed Mokhtar', 'ahmedmo32127@yahoo.com', '2015-03-25 20:03:00.164634', '2015-03-25 20:03:00.164634')
INSERT INTO `accounts` (`user_id`, `provider`, `uid`, `created_at`, `updated_at`) VALUES (1, 'facebook', '792689844113786', '2015-03-25 20:03:00.267370', '2015-03-25 20:03:00.267370')
---
  def create
    @user = User.new(user_params)
    if @user.save
      Account.create(user_id: @user.id, provider: params[:provider], uid: params[:uid])