Mafqood/app/views/missing_posts/index.html.haml

      = select_tag :gender, options_for_select([t("missing_posts.male"), t("missing_posts.female")], params[:gender]), include_blank: t("missing_posts.gender")
      = select_tag :location, options_for_select(Location.all.map { |x| [x, x.id] }, params[:location]), include_blank: t("missing_posts.location")
---
SELECT `missing_posts`.* FROM `missing_posts`  ORDER BY created_at desc